&НаСервере 
Функция ПолучитьГруппуВодители()
      ГруппаВодители=Справочники.ФизическиеЛица.НайтиПоНаименованию("Водители");
	  Если  НЕ ЗначениеЗаполнено(ГруппаВодители) ИЛИ НЕ ГруппаВодители.ЭтоГруппа Тогда
	       Возврат Неопределено;
	  КонецЕсли; 
	  Возврат  ГруппаВодители;

КонецФункции // ()




&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ГруппаВодители = ПолучитьГруппуВодители();	
	Если НЕ ГруппаВодители = Неопределено  Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ГруппаВодители",ГруппаВодители);
		//фиксНастройки = Новый НастройкиКомпоновкиДанных;
		//
		//эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
		//эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//эОтбор.ПравоеЗначение = ГруппаВодители;
		//эОтбор.Использование = Истина;
		//
		//эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		//
		//ПараметрыФормы = Новый Структура;
		//ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
		//ПараметрыФормы.Вставить("ВыборГруппИЭлементов",ИспользованиеГруппИЭлементов.Элементы );
		//ПараметрыФормы.Вставить("РазрешитьВыборКорня",Ложь);
		
		ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаВыбораВодителей", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли; 	
	
КонецПроцедуры
