
&НаСервере
Процедура саУНФ_ПриСозданииНаСервереПосле2(Отказ, СтандартнаяОбработка)
	// Элементы
		
		НовыйЭлемент = Элементы.Добавить("Автомобиль", Тип("ПолеФормы"), ЭтаФорма);
		НовыйЭлемент.ПутьКДанным                    =   "Объект.Автомобиль";
		НовыйЭлемент.Вид                            =   ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ТолькоПросмотр                 =   Ложь;
		НовыйЭлемент.Подсказка                      =   "Автомобиль, закрепленный за водителем";
		НовыйЭлемент.ОтображениеПодсказки           =   ОтображениеПодсказки.Кнопка;
		НовыйЭлемент.ПоложениеЗаголовка             =   ПоложениеЗаголовкаЭлементаФормы.Лево;

КонецПроцедуры
