
&После("ПриОпределенииНастроекРегламентныхЗаданий")
Процедура саУНФ_ПриОпределенииНастроекРегламентныхЗаданий(Настройки)
	
	
		НоваяСтрока = Настройки.Добавить();
		НоваяСтрока.РегламентноеЗадание = Метаданные.РегламентныеЗадания["са_УНФ_АвтозаказРТТ"];
		НоваяСтрока.РаботаетСВнешнимиРесурсами = Истина;
	
		НоваяСтрока = Настройки.Добавить();
		НоваяСтрока.РегламентноеЗадание = Метаданные.РегламентныеЗадания["са_УНФ_КонтрольРасписания"];
		НоваяСтрока.РаботаетСВнешнимиРесурсами = Истина;
		
		НоваяСтрока = Настройки.Добавить();
		НоваяСтрока.РегламентноеЗадание = Метаданные.РегламентныеЗадания["саУНФ_ВыгрузкаКонтрагентов"];
		НоваяСтрока.РаботаетСВнешнимиРесурсами = Истина;

		НоваяСтрока = Настройки.Добавить();
		НоваяСтрока.РегламентноеЗадание = Метаданные.РегламентныеЗадания["саУНФ_СообщениеОПросроченныхРезервах"];
		НоваяСтрока.РаботаетСВнешнимиРесурсами = Истина;

КонецПроцедуры
