&НаСервере
Функция ПосчитатьКоличествоВСпискеНаСервере()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = МакетКомпоновки.НаборыДанных.НаборДанныхДинамическогоСписка.Запрос;
	СтрокаВЫБРАТЬ = Лев(Запрос.Текст, Найти(Запрос.Текст, Символы.ПС));
	
	Запрос.Текст = СтрокаВЫБРАТЬ + "Количество(*) КАК Кол" + Сред(Запрос.Текст, Найти(Запрос.Текст, Символы.ПС + "ИЗ" + Символы.ПС));
	Для Каждого парам из МакетКомпоновки.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(парам.Имя, парам.Значение);
	КонецЦикла;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
	         Возврат 0;
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат  Выборка.Кол;

КонецФункции



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Контрагент") Тогда
		Закрыть();
	КонецЕсли; 
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент",Параметры.Контрагент);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоСтрок = ПосчитатьКоличествоВСпискеНаСервере();
    Если КоличествоСтрок =0 Тогда
	    СтруктураПараметров = Неопределено;
		Оповестить("Выбран другой адрес",СтруктураПараметров,);
		Закрыть();
	КонецЕсли; 

КонецПроцедуры




&НаСервере
Функция СтруктураПоКлючуРегистра(ВыбраннаяСтрока)
    НаборЗаписей = РегистрыСведений.саУНФ_ДополнительнаяКонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(ВыбраннаяСтрока.Контрагент);
	НаборЗаписей.Отбор.Наименование.Установить(ВыбраннаяСтрока.Наименование); 
	НаборЗаписей.Прочитать();
	
	СтруктураЗаписи = Новый Структура("Наименование,Представление,ЗначенияПолей,Значение",);
	
	Для каждого Запись Из НаборЗаписей Цикл
	       ЗаполнитьЗначенияСвойств(СтруктураЗаписи,Запись);
	КонецЦикла; 
	

	 Возврат  СтруктураЗаписи;

КонецФункции // ()


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = СтруктураПоКлючуРегистра(ВыбраннаяСтрока);
	Оповестить("Выбран другой адрес",СтруктураПараметров,);
	Закрыть();
КонецПроцедуры

