#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ДобавитьКомандыПечати")
Процедура саУНФ_ДобавитьКомандыПечати(КомандыПечати)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = Обработки.ПечатьЛистаЗагрузки.ИдентификаторПечатнойФормы();
	КомандаПечати.Представление = Обработки.ПечатьЛистаЗагрузки.ПредставлениеПФ();
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 36;
	
	КомандаПечати = КомандыПечати.Добавить();
   КомандаПечати.Идентификатор = "ПечатьQR";
   КомандаПечати.Представление ="Печать QR";
   КомандаПечати.СписокФорм = "ФормаДокумента";
   КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
   КомандаПечати.Порядок = 50;

КонецПроцедуры

&После("Печать")
Процедура саУНФ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, Обработки.ПечатьЛистаЗагрузки.ИдентификаторПечатнойФормы());
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьЛистаЗагрузки.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьЛистаЗагрузки.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьЛистаЗагрузки.ПредставлениеПФ();         
		
		//ДанныеОбъектовПечати = ДанныеДокументовАктОбОказанииУслуг(МассивОбъектов, Ложь);
		Обработки.ПечатьЛистаЗагрузки.СформироватьПФ(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПечатьQR");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.саУНФ_ПечатьQR.КлючПараметровПечати();;
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.саУНФ_ПечатьQR.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.саУНФ_ПечатьQR.ПредставлениеПФ();         
		
		//ДанныеОбъектовПечати = ДанныеДокументовАктОбОказанииУслуг(МассивОбъектов, Ложь);
		Обработки.саУНФ_ПечатьQR.СформироватьПФ(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;

КонецПроцедуры                                                                                           




#КонецЕсли