
&После("ДобавитьКомандыПечати")
Процедура саУНФ_ДобавитьКомандыПечати(КомандыПечати)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = Обработки.ПечатьЛистаЗагрузки.ИдентификаторПечатнойФормы();
	КомандаПечати.Представление = Обработки.ПечатьЛистаЗагрузки.ПредставлениеПФ();
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 36;

КонецПроцедуры


&После("Печать")
Процедура саУНФ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, Обработки.ПечатьЛистаЗагрузки.ИдентификаторПечатнойФормы());
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьЛистаЗагрузки.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьЛистаЗагрузки.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьЛистаЗагрузки.ПредставлениеПФ();         
		
		Обработки.ПечатьЛистаЗагрузки.СформироватьПФ(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
КонецПроцедуры

