
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрыВыполненияКоманды.Источник.ЭтаФорма.Отчет.ИмяПользователя);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}

КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ИмяПользователя)
	Отчеты.саУНФ_СписокРолейПользователя.Печать(ТабДок, ИмяПользователя);
КонецПроцедуры
