
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Список.Параметры.УстановитьЗначениеПараметра("ГруппаВодители",Параметры.ГруппаВодители);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Адрес = ПоместитьВоВременноеХранилище(ВыбраннаяСтрока);
	СтруктураВыбора = Новый Структура("Адрес,ВыбранВодитель",Адрес,Истина);
	ОповеститьОВыборе(СтруктураВыбора);
КонецПроцедуры
