&НаСервере
Функция КаталогОтбора()
СтруктураНастроек=саУНФ_РаботаСОМА.ПолучитьСтруктураНастроекОМА(); 
Возврат СтруктураНастроек.КаталогТоваров;
КонецФункции // ()
 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	
	//фиксНастройки = Новый НастройкиКомпоновкиДанных;
	//
	//эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	//эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	//эОтбор.ПравоеЗначение =КаталогОтбора();
	//эОтбор.Использование = Истина;
	//
	//эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ПользовательскиеНастройки", фиксНастройки);
	Отбор = Новый Структура;
	Отбор.Вставить("Родитель", КаталогОтбора());
	ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("Отбор",Отбор);
	ОткрытьФорму("Справочник.Номенклатура.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
