
&После("ПриКопировании")
Процедура саУНФ_ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ФИОВодителя = "";
	ЭтотОбъект.Водитель        =  Справочники.ФизическиеЛица.ПустаяСсылка();
КонецПроцедуры


&После("ПриЗаписи")
Процедура саУНФ_ПриЗаписи(Отказ)
	
КонецПроцедуры


&После("ПередЗаписью")
Процедура саУНФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если  ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Если ЗначениеЗаполнено(Заказ.ПАК_МаршрутныйЛист) Тогда
			ЭтотОбъект.ФИОВодителя =  Заказ.ПАК_МаршрутныйЛист.ФиоВодителя;
			ЭтотОбъект.Водитель        =   Заказ.ПАК_МаршрутныйЛист.Курьер;
			
			Если НЕ ЗначениеЗаполнено(ПоложениеЗаказаПокупателя)
				ИЛИ ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
				
				ПоложениеЗаказаПокупателя            = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
				
			КонецЕсли;
			
			
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

