Функция ПолучитьКассуЛогистики()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	саУНФ_НастройкаЛогистики.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.саУНФ_НастройкаЛогистики КАК саУНФ_НастройкаЛогистики
		|ГДЕ
		|	саУНФ_НастройкаЛогистики.Параметр = ""Касса""";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий() ;
      	Возврат  Выборка.Значение;
	Иначе
		Касса = Справочники.КассыККМ.НайтиПоКоду("000000165");
	    Если Касса = Справочники.КассыККМ.ПустаяСсылка() Тогда
		       Возврат Неопределено;
		Иначе	
		       Возврат Касса;
		КонецЕсли;
	КонецЕсли; 
			
КонецФункции // ()
 


&После("ПередЗаписью")
Процедура саУНФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	  Если ЗначениеЗаполнено(Заказ) Тогда
		      УстановитьПривилегированныйРежим(Истина);
		      Касса =  ПолучитьКассуЛогистики();
			  Если ПривилегированныйРежим() Тогда
			          УстановитьПривилегированныйРежим(Ложь);
			  КонецЕсли; 
			  
			  Если  Не Касса = Неопределено И Касса = КассаККМ Тогда
			            Ответственный = Заказ.Ответственный;
			  КонецЕсли; 
	//***Начало***08.02.2022***МурашкоВ
	ОМ= ОбщегоНазначения.ОбщийМодуль("саУНФ_РаботаСОМА");
	Если  НЕ ОМ=Неопределено Тогда
		СписокНастроек = ОМ.ПолучитьСтруктураНастроекОМА();
		Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
			И Заказ.ВидЗаказа =СписокНастроек.ВидЗаказаОМА Тогда
			КоллекцияСтрок1 = Заказ.Запасы.Выгрузить(,"Номенклатура,Партия,Количество");
			КоллекцияСтрок2 = Запасы.Выгрузить(,"Номенклатура,Партия,Количество");
			Результат = ОбщегоНазначения.КоллекцииИдентичны(КоллекцияСтрок1, КоллекцияСтрок2);
			Если  Не Результат Тогда
				СтатусЗаказа = СписокНастроек.СостояниеЧастичныйВозврат;
			Иначе	
				СтатусЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен;
			КонецЕсли; 
			Если  НЕ Заказ.СостояниеЗаказа =СтатусЗаказа  Тогда
				
				ЗаказОбъект=Заказ.ПолучитьОбъект();
				ЗаказОбъект.СостояниеЗаказа = СтатусЗаказа; 
				Попытка
					ЗаказОбъект.Записать();
				Исключение
					ОбщегоНазначения.СообщитьПользователю("Не удалось изменить статус заказа "+Строка(Заказ));
				КонецПопытки;  	
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЕсли;

	//***Конец***08.02.2022***МурашкоВ		  
			  
			  
		 КонецЕсли; 
	
КонецПроцедуры
