Функция Печать(ТабДок, Ссылка) Экспорт
	Макет = Отчеты.саУНФ_СписокРолейПользователя.ПолучитьМакет("Макет");

	Шапка = Макет.ПолучитьОбласть("Шапка");
	Подвал = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Очистить();
	Шапка.Параметры.Пользователь = Ссылка;
	ТабДок.Вывести(Шапка);
	
	СписокРолей		= саУНФ_ОбщийМодуль.ПолучитьСписокРолейПользователя(Ссылка.ИдентификаторПользователяИБ) ;
	Для Каждого РольПользователя ИЗ СписокРолей Цикл
		Подвал.Параметры.РольПользователя = РольПользователя.Ключ;
		
		ТабДок.Вывести(Подвал);
		
		
	КонецЦикла;
	Возврат  ТабДок;
КонецФункции
