#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
	
Процедура ПередУдалением(Отказ)
	//Задание = ОбменССайтомРегламентныеЗадания.НайтиЗадание(ИдентификаторРегламентногоЗадания);
	//Если Задание <> Неопределено Тогда
	//	ОбменССайтомРегламентныеЗадания.УдалитьЗадание(Задание);
	//КонецЕсли;
	//ИдентификаторРегламентногоЗадания = Неопределено;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустаяСтрока(Код) Тогда
		УстановитьНовыйКод();
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		СформироватьНаименование()
	КонецЕсли;
	
		//ОбщегоНазначения.СообщитьПользователю(Сообщение, ЭтотОбъект, Поле);
		

	ДобавитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Код = "";
	//ИдентификаторРегламентногоЗадания = НеОпределено;
КонецПроцедуры

#КонецОбласти


#Область ПрограммныйИнтерфейс

Процедура СформироватьНаименование() Экспорт
	Наименование = "Обмен с ОМА";
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты)
	
	//Если ВыгружатьНаСайт Тогда
	//	
	//	ПроверяемыеРеквизиты.Добавить("АдресСайта");
	//	ПроверяемыеРеквизиты.Добавить("ИмяПользователя");
	//	
	//Иначе
	//	
	//	ПроверяемыеРеквизиты.Добавить("КаталогВыгрузки");
	//	
	//КонецЕсли;

КонецПроцедуры

#КонецОбласти


#КонецОбласти

#КонецЕсли