
&Вместо("ПередЗаписьюНаСервере")
Процедура саУНФ_ПередЗаписьюНаСервере(Форма, ТекущийОбъект)
	Если  ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.Контрагенты")   Тогда
		ТекущийОбъект.КонтактнаяИнформация.Очистить();
		
		Для Каждого ДанныеКИ Из Форма.КонтактнаяИнформация Цикл
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ТекущийОбъект, ДанныеКИ.Значение, ДанныеКИ.Вид, ДанныеКИ.Тип, ДанныеКИ.id_adress);
		КонецЦикла;
		
		
	Иначе
		ПродолжитьВызов(Форма, ТекущийОбъект);
	КонецЕсли; 
	
КонецПроцедуры

&Вместо("ДобавитьРеквизитыФормыКонтактнойИнформации")
Процедура саУНФ_ДобавитьРеквизитыФормыКонтактнойИнформации(Форма, ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти)
	Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента"  Тогда
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		СписокРеквизитовФормы = Форма.ПолучитьРеквизиты();
		
		СоздатьТаблицуКонтактнаяИнформация = Истина;
		СоздатьТаблицуСвойстваВидовКонтактнойИнформации = Истина;
		
		Для Каждого Реквизит Из СписокРеквизитовФормы Цикл
			Если Реквизит.Имя = "КонтактнаяИнформация" Тогда
				СоздатьТаблицуКонтактнаяИнформация = Ложь;
			ИначеЕсли Реквизит.Имя = "СвойстваВидовКонтактнойИнформации" Тогда
				СоздатьТаблицуСвойстваВидовКонтактнойИнформации = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		ОписаниеСтрока = Новый ОписаниеТипов("Строка");
		ОписаниеБулево = Новый ОписаниеТипов("Булево");
		
		
		
		Если СоздатьТаблицуКонтактнаяИнформация Тогда
			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти", ОписаниеБулево));
			
			ИмяТаблицы = "КонтактнаяИнформация";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500)), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Комментарий", ОписаниеСтрока, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Значение", ОписаниеСтрока, ИмяТаблицы));
			Если ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
				МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИдентификаторСтрокиТабличнойЧасти", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Неотрицательный)), ИмяТаблицы));
			КонецЕсли;
			
			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("id_adress", Новый ОписаниеТипов("УникальныйИдентификатор"), ИмяТаблицы));
			
			
			
			
			
		КонецЕсли;
		
		Если СоздатьТаблицуСвойстваВидовКонтактнойИнформации Тогда
			
			ИмяТаблицы = "СвойстваВидовКонтактнойИнформации";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПредставлениеВида", ОписаниеСтрока, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВыводитьВФормеВсегда", ОписаниеБулево, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РазрешитьВводНесколькихЗначений", ОписаниеБулево, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ОбязательноеЗаполнение", ОписаниеБулево, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроверятьКорректность", ОписаниеБулево, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВидРедактирования", ОписаниеСтрока, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВидПоляДругое", ОписаниеСтрока, ИмяТаблицы));
			
		КонецЕсли;
		
		Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		КонецЕсли;
	Иначе
		ПродолжитьВызов(Форма, ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры
