
Функция СведенияОВнешнейОбработке() Экспорт
	
	Структура = Новый Структура;
    Структура.Вставить("Вид", "ДополнительныйОтчет"); //Перечисления.ВидыДополнительныхОтчетовИОбработок.
    Структура.Вставить("Наименование", "Отчет по отклонениям от МАП");
    Структура.Вставить("Версия", ТекущаяДатаСеанса());
    Структура.Вставить("БезопасныйРежим", Ложь);
    Структура.Вставить("Информация", "Отчет по отклонениям от МАП");

    Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Идентификатор");
    Команды.Колонки.Добавить("Представление");
    Команды.Колонки.Добавить("Модификатор");
    Команды.Колонки.Добавить("ПоказыватьОповещение");
    Команды.Колонки.Добавить("Использование");

    НоваяСтрока = Команды.Добавить();
    НоваяСтрока.Идентификатор = "ОткрытьФорму";
    НоваяСтрока.Представление = "Отчет по отклонениям от МАП";
    НоваяСтрока.Модификатор   = "";
    НоваяСтрока.ПоказыватьОповещение = Ложь;
    НоваяСтрока.Использование = "ОткрытиеФормы";

	Структура.Вставить("Команды", Команды);

	Возврат Структура;
	
КонецФункции


