&НаСервере 
Функция ПроверитьПараметрКоманды(ПараметрКоманды)
	Если ТипЗнч(ПараметрКоманды)<>ТИП("СправочникСсылка.СтруктурныеЕдиницы") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы.ДополнительныеРеквизиты КАК СтруктурныеЕдиницыДополнительныеРеквизиты
	|ГДЕ
	|	СтруктурныеЕдиницыДополнительныеРеквизиты.Свойство.Имя ПОДОБНО ""%ДействующийМагазин%""
	|	И ТИПЗНАЧЕНИЯ(СтруктурныеЕдиницыДополнительныеРеквизиты.Значение) = ТИП(БУЛЕВО)
	|	И СтруктурныеЕдиницыДополнительныеРеквизиты.Значение = ИСТИНА
	|	И НЕ СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка.ПометкаУдаления
	|	И СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка = &Магазин";
	
	Запрос.УстановитьПараметр("Магазин",ПараметрКоманды);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой()  Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции // ()



&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	Если ПроверитьПараметрКоманды(ПараметрКоманды)  Тогда
		// Создание структуры значений
	СтруктураФормы = Новый Структура;
	СтруктураФормы.Вставить("Точка",	ПараметрКоманды);

	// Почему-то нужно создавать запись через массив (по другому не взлетало)
	МассивКлюча = Новый Массив;
	МассивКлюча.Добавить(СтруктураФормы);
	
	// Создание ключа записи регистра сведений
	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.caУНФ_ТочкиДляАвтозаказа", МассивКлюча);
	
	// Структура ключа записи для поиска при открытии
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Ключ", КлючЗаписи);
	
	// Если запись не будет найдена, вызовем заполнение измерений.
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ЗначенияЗаполнения", СтруктураФормы);
		
		
		
		
		Попытка
		ОткрытьФорму("РегистрСведений.caУНФ_ТочкиДляАвтозаказа.ФормаЗаписи", СтруктураКлюча, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		Исключение
		ОткрытьФорму("РегистрСведений.caУНФ_ТочкиДляАвтозаказа.ФормаЗаписи", СтруктураЗаполнения, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		КонецПопытки
	КонецЕсли; 
	
	
КонецПроцедуры
