
&НаСервере
Процедура ПотребностиНаСервере()
	//ОбъектМодуль = РеквизитФормыВЗначение("Объект");
	//ОбъектМодуль.РассчитатьПотребности();
	
	 Если Метаданные.Обработки.Найти("саУНФ_Автозаказ") <> Неопределено Тогда
		Обработки["саУНФ_Автозаказ"].РассчитатьПотребности();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Потребности(Команда)
    ПотребностиНаСервере();
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация	=	УправлениеНебольшойФирмойПовтИсп.ОрганизацияПоУмолчанию();
КонецПроцедуры

