
&После("ПередЗаписью")
Процедура саУНФ_ПередЗаписью(Отказ, Замещение)
	УстановитьПривилегированныйРежим(Истина);

	УзелЮрЛ =  ПланыОбмена.ОбменКонтрагенты.НайтиПоКоду("2");
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		
		Источник = ТекЗапись.Контрагент;
		
		Если  НЕ Источник.Покупатель ИЛИ  Источник.ПометкаУдаления ИЛИ Источник.Недействителен ИЛИ НЕ ЗначениеЗаполнено(Источник.СтранаРегистрации) 
			ИЛИ НЕ Источник.Проверен  ИЛИ  НЕ ВРЕГ(Источник.СтранаРегистрации.Наименование) = "БЕЛАРУСЬ"
			Тогда  
			Продолжить; 
		КонецЕсли;
		
		
		
		
		Если Источник.ВидКонтрагента=Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель
			Или  Источник.ВидКонтрагента=Перечисления.ВидыКонтрагентов.ЮридическоеЛицо
			Тогда
			Если НЕ ЗначениеЗаполнено(Источник.ИНН) ИЛИ НЕ СтрДлина(Источник.ИНН)=9 
				ИЛИ НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Источник.ИНН) Тогда
				Продолжить;
			КонецЕсли; 
			
			
			Если  НЕ ПланыОбмена.ИзменениеЗарегистрировано(УзелЮрЛ,Источник) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзелЮрЛ,Источник);		
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;	
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры
