   



Процедура ДобавитьСообщенияВМессенджер(СтрОбсуждениеИд, СтрСообщениеИд)  Экспорт
	СообщениеВз =СистемаВзаимодействия.ПолучитьСообщение(СтрСообщениеИд);
	Обсуждение=СистемаВзаимодействия.ПолучитьОбсуждение(СтрОбсуждениеИд);
	ЗаголовокОбсуждения = СистемаВзаимодействия.ПолучитьОбсуждение(СтрОбсуждениеИд).Заголовок;
	Если ЗаголовокОбсуждения ="Автоснятие резервов"  Тогда
		    УстановитьПривилегированныйРежим(Истина);
			БотДимон = саУНФ_ОбщийМодуль.ПоискБота("Бот Димон"); 
		     Если НЕ СообщениеВз.Автор =БотДимон И Обсуждение.Участники.Содержит(БотДимон) Тогда
				 ТекстСообщения = саУНФ_ОбщийМодуль.РандомныйТекст();
				 СообщениеДляОбсуждения  = СистемаВзаимодействия.СоздатьСообщение(СтрОбсуждениеИд);
				 СообщениеДляОбсуждения.Дата = ТекущаяДата();
				 СообщениеДляОбсуждения.Автор =БотДимон;
				 СообщениеДляОбсуждения.Получатели.Добавить(СообщениеВз.Автор);
				 СообщениеДляОбсуждения.Получатели.Добавить(БотДимон);
				 СообщениеДляОбсуждения.Текст   = Новый ФорматированнаяСтрока(ТекстСообщения);
				 СообщениеДляОбсуждения.Записать();
				Если ПривилегированныйРежим() Тогда
				        УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли;  
				 
			 КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры 
