
Процедура ПередЗаписью(Отказ, Замещение)
	ОМ_УА = ОбщегоНазначения.ОбщийМодуль("саУНФ_Bitrix");
	Если НЕ ОМ_УА =Неопределено Тогда
		Для Каждого ТекЗапись Из ЭтотОбъект Цикл
			АдресВСвободнойФорме = Истина;
			Если ЛЕВ(СОКРЛП(ТекЗапись.Значение),1)="{" Тогда
				
				АдресВСвободнойФорме = УправлениеКонтактнойИнформацией.АдресВведенВСвободнойФорме(ТекЗапись.Значение);
				Если НЕ АдресВСвободнойФорме И ЗначениеЗаполнено(ТекЗапись.Представление) Тогда
					ЗаписьGEOКоординаты=ОМ_УА.ЗапросКоординатПоАдресу(ТекЗапись.Представление);
					
					Если ЗначениеЗаполнено(ЗаписьGEOКоординаты) Тогда
						Если ЗначениеЗаполнено(ЗаписьGEOКоординаты) Тогда
							ТекЗапись.GEOКоординаты = ЗаписьGEOКоординаты;
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли;    
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли;
Если НЕ ЗначениеЗаполнено(ТекЗапись.id_adress) Тогда

	         ТекЗапись.id_adress = Новый УникальныйИдентификатор();

КонецЕсли;	
КонецПроцедуры
