
&Вместо("КонтактнаяИнформацияОбработкаПроверкиЗаполнения")
Процедура саУНФ_КонтактнаяИнформацияОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты)
	Если ТипЗнч(Источник)= Тип("СправочникОбъект.Контрагенты") Тогда
		
		//***Начало***21.10.2021***МурашкоВ
		ОМ = ОбщегоНазначения.ОбщийМодуль("саУНФ_ОбщийМодуль");
		Если Не ОМ=Неопределено Тогда
			НеПроверятьКонтрагента = ОМ.ЗаписьКонтрагентаБезПроверки();
			Если НеПроверятьКонтрагента Тогда
				ПроверяемыеРеквизиты.Очистить(); 			
			КонецЕсли;
			Возврат;
		КонецЕсли; 
		//***Конец***21.10.2021***МурашкоВ

		
		
		
		Если НЕ Источник.Недействителен Тогда
			ПродолжитьВызов(Источник, Отказ, ПроверяемыеРеквизиты);
		КонецЕсли; 
	Иначе	
		ПродолжитьВызов(Источник, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли; 	
КонецПроцедуры
