Функция ОстаткиВКассах(ДатаОбработки,КассаККМ=Неопределено) Экспорт
	ПараметрыСтроки = Новый КвалификаторыСтроки(50);
	
	ТаблицаМайлов = Новый ТаблицаЗначений;
	ТаблицаМайлов.Колонки.Добавить("РуководительПодразделения",Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаМайлов.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка",,,,ПараметрыСтроки));
	ТаблицаМайлов.Колонки.Добавить("КопияЭП", Новый ОписаниеТипов("Строка"));

	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст="ВЫБРАТЬ
	             |	СтруктурныеЕдиницы.Ссылка КАК Магазин,
	             |	&G1 КАК РуководительПодразделения
	             |ПОМЕСТИТЬ ВТ_МАГАЗИНЫ
	             |ИЗ
	             |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы.ДополнительныеРеквизиты КАК СтруктурныеЕдиницыДополнительныеРеквизиты
	             |		ПО (СтруктурныеЕдиницыДополнительныеРеквизиты.Свойство.Имя ПОДОБНО ""%ДействующийМагазин%"")
	             |			И (ТИПЗНАЧЕНИЯ(СтруктурныеЕдиницыДополнительныеРеквизиты.Значение) = ТИП(БУЛЕВО))
	             |			И (СтруктурныеЕдиницыДополнительныеРеквизиты.Значение = ИСТИНА)
	             |			И СтруктурныеЕдиницы.Ссылка = СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка
	             |			И (&G2)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЕСТЬNULL(ПользователиКонтактнаяИнформация.АдресЭП, """") КАК АдресЭП,
	             |	ВТ_МАГАЗИНЫ.РуководительПодразделения КАК РуководительПодразделения,
	             |	ВТ_МАГАЗИНЫ.Магазин КАК Магазин
	             |ПОМЕСТИТЬ ВТ_АДРЕСАПОЧТЫ
	             |ИЗ
	             |	ВТ_МАГАЗИНЫ КАК ВТ_МАГАЗИНЫ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	             |		ПО ВТ_МАГАЗИНЫ.РуководительПодразделения = ПользователиКонтактнаяИнформация.Ссылка
	             |			И (ПользователиКонтактнаяИнформация.Тип = &ТипКИ)
	             |			И (ПользователиКонтактнаяИнформация.Вид = &ВидКИ)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ВТ_АДРЕСАПОЧТЫ.РуководительПодразделения КАК РуководительПодразделения,
	             |	ВТ_АДРЕСАПОЧТЫ.АдресЭП КАК АдресЭП
	             |ИЗ
	             |	ВТ_АДРЕСАПОЧТЫ КАК ВТ_АДРЕСАПОЧТЫ";
	
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"&G1","ЕСТЬNULL(СтруктурныеЕдиницы.bp3_РуководительПодразделения,ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))");			 
	Запрос.УстановитьПараметр(	"ТипКИ",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр(	"ВидКИ",Справочники.ВидыКонтактнойИнформации.EmailПользователя);

	Если ЗначениеЗаполнено(КассаККМ) Тогда
	         Запрос.Текст=СтрЗаменить(Запрос.Текст,"И (&G2)","ГДЕ СтруктурныеЕдиницы.Ссылка = &СтруктурнаяЕдКассы");
		     Запрос.УстановитьПараметр("СтруктурнаяЕдКассы",КассаККМ.СтруктурнаяЕдиница);
	Иначе	
	        Запрос.Текст=СтрЗаменить(Запрос.Текст,"И (&G2)","");
	КонецЕсли;

    ТаблицаАдресов = Запрос.Выполнить().Выгрузить();
	Для каждого  СтрокаТА Из ТаблицаАдресов Цикл
	        СписокПоиска = Новый Структура("РуководительПодразделения",СтрокаТА.РуководительПодразделения);
		    МассивТаблицаМайлов = ТаблицаМайлов.НайтиСтроки(СписокПоиска); 
			Если МассивТаблицаМайлов.Количество()>0 Тогда
			        Если  ЗначениеЗаполнено(МассивТаблицаМайлов[0].АдресЭП) Тогда
						Если  ЗначениеЗаполнено(МассивТаблицаМайлов[0].КопияЭП) Тогда
							МассивТаблицаМайлов[0].КопияЭП=МассивТаблицаМайлов[0].КопияЭП+";"+СОКРЛП(СтрокаТА.АдресЭП);
						Иначе
							МассивТаблицаМайлов[0].КопияЭП=СОКРЛП(СтрокаТА.АдресЭП);
						КонецЕсли; 			
					КонецЕсли; 
			Иначе	
			        НоваяСтрока =  ТаблицаМайлов.Добавить();
					НоваяСтрока.РуководительПодразделения =  СтрокаТА.РуководительПодразделения;
					НоваяСтрока.АдресЭП =  СОКРЛП(СтрокаТА.АдресЭП);
			КонецЕсли; 
	
	КонецЦикла; 
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст="ВЫБРАТЬ
	             |	ТаблицаМайлов.РуководительПодразделения КАК РуководительПодразделения,
	             |	ТаблицаМайлов.АдресЭП КАК АдресЭП,
	             |	ТаблицаМайлов.КопияЭП КАК КопияЭП
	             |ПОМЕСТИТЬ ВТ_ТАБМАЙЛОВ
	             |ИЗ
	             |	&ТаблицаМайлов КАК ТаблицаМайлов
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_МАГАЗИНЫ.Магазин КАК Магазин,
	             |	ВТ_МАГАЗИНЫ.РуководительПодразделения КАК РуководительПодразделения,
	             |	ВТ_ТАБМАЙЛОВ.АдресЭП КАК АдресЭП
	             |ПОМЕСТИТЬ ВТ_АДРЕСАПОЧТЫ2
	             |ИЗ
	             |	ВТ_МАГАЗИНЫ КАК ВТ_МАГАЗИНЫ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТАБМАЙЛОВ КАК ВТ_ТАБМАЙЛОВ
	             |		ПО ВТ_МАГАЗИНЫ.РуководительПодразделения = ВТ_ТАБМАЙЛОВ.РуководительПодразделения
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_АДРЕСАПОЧТЫ2.АдресЭП КАК АдресЭП,
	             |	ВТ_АДРЕСАПОЧТЫ2.РуководительПодразделения КАК Руководитель,
	             |	ВТ_АДРЕСАПОЧТЫ2.Магазин КАК Магазин,
	             |	ДенежныеСредстваВКассахККМОстатки.КассаККМ КАК КассаККМ,
	             |	СУММА(ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток, 0)) КАК Сумма,
	             |	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток, 0) - 1000 КАК СуммаПревышения
	             |ИЗ
	             |	ВТ_АДРЕСАПОЧТЫ2 КАК ВТ_АДРЕСАПОЧТЫ2
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	             |				&Период,
	             |				КассаККМ.СтруктурнаяЕдиница В
	             |					(ВЫБРАТЬ
	             |						ВТ_АДРЕСАПОЧТЫ2.Магазин КАК Магазин
	             |					ИЗ
	             |						ВТ_АДРЕСАПОЧТЫ2 КАК ВТ_АДРЕСАПОЧТЫ2)) КАК ДенежныеСредстваВКассахККМОстатки
	             |		ПО ВТ_АДРЕСАПОЧТЫ2.Магазин = ДенежныеСредстваВКассахККМОстатки.КассаККМ.СтруктурнаяЕдиница
	             |			И (ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток > 1000)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ДенежныеСредстваВКассахККМОстатки.КассаККМ,
	             |	ВТ_АДРЕСАПОЧТЫ2.Магазин,
	             |	ВТ_АДРЕСАПОЧТЫ2.АдресЭП,
	             |	ВТ_АДРЕСАПОЧТЫ2.РуководительПодразделения,
	             |	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаВалОстаток, 0) - 1000
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Руководитель,
	             |	Магазин
	             |ИТОГИ ПО
	             |	АдресЭП
	             |АВТОУПОРЯДОЧИВАНИЕ";

		Запрос.УстановитьПараметр(	"Период",НачалоДня(ДатаОбработки)+10*60*60+20*60);
	    Запрос.УстановитьПараметр("ТаблицаМайлов",ТаблицаМайлов);

		
	 

	
	
	Результат = Запрос.Выполнить();

	// саУНФ_ОбщийМодуль.ПоказатьВременнуюТаблицу(МВТ, "ВТ_МАГАЗИНЫ") 
	Возврат Результат;
КонецФункции // ()
 